apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_uart.h
/* UART_TX_BRK_IDLE_DONE_INT_ST : RO; bitpos: [13]; default: 0;
 * This is the status bit for UART_TX_BRK_IDLE_DONE_INT_RAW when
 * UART_TX_BRK_IDLE_DONE_INT_ENA is set to 1.
 */

#define UART_TX_BRK_IDLE_DONE_INT_ST    (BIT(13))
#define UART_TX_BRK_IDLE_DONE_INT_ST_M  (UART_TX_BRK_IDLE_DONE_INT_ST_V << UART_TX_BRK_IDLE_DONE_INT_ST_S)
#define UART_TX_BRK_IDLE_DONE_INT_ST_V  0x00000001
#define UART_TX_BRK_IDLE_DONE_INT_ST_S  13

/* UART_TX_BRK_DONE_INT_ST : RO; bitpos: [12]; default: 0;
 * This is the status bit for UART_TX_BRK_DONE_INT_RAW when
 * UART_TX_BRK_DONE_INT_ENA is set to 1.
 */

#define UART_TX_BRK_DONE_INT_ST    (BIT(12))
#define UART_TX_BRK_DONE_INT_ST_M  (UART_TX_BRK_DONE_INT_ST_V << UART_TX_BRK_DONE_INT_ST_S)
#define UART_TX_BRK_DONE_INT_ST_V  0x00000001
#define UART_TX_BRK_DONE_INT_ST_S  12

/* UART_GLITCH_DET_INT_ST : RO; bitpos: [11]; default: 0;
 * This is the status bit for UART_GLITCH_DET_INT_RAW when
 * UART_GLITCH_DET_INT_ENA is set to 1.
 */

#define UART_GLITCH_DET_INT_ST    (BIT(11))
#define UART_GLITCH_DET_INT_ST_M  (UART_GLITCH_DET_INT_ST_V << UART_GLITCH_DET_INT_ST_S)
#define UART_GLITCH_DET_INT_ST_V  0x00000001
#define UART_GLITCH_DET_INT_ST_S  11

/* UART_SW_XOFF_INT_ST : RO; bitpos: [10]; default: 0;
 * This is the status bit for UART_SW_XOFF_INT_RAW when UART_SW_XOFF_INT_ENA
 * is set to 1.
 */

#define UART_SW_XOFF_INT_ST    (BIT(10))
#define UART_SW_XOFF_INT_ST_M  (UART_SW_XOFF_INT_ST_V << UART_SW_XOFF_INT_ST_S)
#define UART_SW_XOFF_INT_ST_V  0x00000001
#define UART_SW_XOFF_INT_ST_S  10

/* UART_SW_XON_INT_ST : RO; bitpos: [9]; default: 0;
 * This is the status bit for UART_SW_XON_INT_RAW when UART_SW_XON_INT_ENA
 * is set to 1.
 */

#define UART_SW_XON_INT_ST    (BIT(9))
#define UART_SW_XON_INT_ST_M  (UART_SW_XON_INT_ST_V << UART_SW_XON_INT_ST_S)
#define UART_SW_XON_INT_ST_V  0x00000001
#define UART_SW_XON_INT_ST_S  9

/* UART_RXFIFO_TOUT_INT_ST : RO; bitpos: [8]; default: 0;
 * This is the status bit for UART_RXFIFO_TOUT_INT_RAW when
 * UART_RXFIFO_TOUT_INT_ENA is set to 1.
 */

#define UART_RXFIFO_TOUT_INT_ST    (BIT(8))
#define UART_RXFIFO_TOUT_INT_ST_M  (UART_RXFIFO_TOUT_INT_ST_V << UART_RXFIFO_TOUT_INT_ST_S)
#define UART_RXFIFO_TOUT_INT_ST_V  0x00000001
#define UART_RXFIFO_TOUT_INT_ST_S  8

/* UART_BRK_DET_INT_ST : RO; bitpos: [7]; default: 0;
 * This is the status bit for UART_BRK_DET_INT_RAW when UART_BRK_DET_INT_ENA
 * is set to 1.
 */

#define UART_BRK_DET_INT_ST    (BIT(7))
#define UART_BRK_DET_INT_ST_M  (UART_BRK_DET_INT_ST_V << UART_BRK_DET_INT_ST_S)
#define UART_BRK_DET_INT_ST_V  0x00000001
#define UART_BRK_DET_INT_ST_S  7

/* UART_CTS_CHG_INT_ST : RO; bitpos: [6]; default: 0;
 * This is the status bit for UART_CTS_CHG_INT_RAW when UART_CTS_CHG_INT_ENA
 * is set to 1.
 */

#define UART_CTS_CHG_INT_ST    (BIT(6))
#define UART_CTS_CHG_INT_ST_M  (UART_CTS_CHG_INT_ST_V << UART_CTS_CHG_INT_ST_S)
#define UART_CTS_CHG_INT_ST_V  0x00000001
#define UART_CTS_CHG_INT_ST_S  6

/* UART_DSR_CHG_INT_ST : RO; bitpos: [5]; default: 0;
 * This is the status bit for UART_DSR_CHG_INT_RAW when UART_DSR_CHG_INT_ENA
 * is set to 1.
 */

#define UART_DSR_CHG_INT_ST    (BIT(5))
#define UART_DSR_CHG_INT_ST_M  (UART_DSR_CHG_INT_ST_V << UART_DSR_CHG_INT_ST_S)
#define UART_DSR_CHG_INT_ST_V  0x00000001
#define UART_DSR_CHG_INT_ST_S  5

/* UART_RXFIFO_OVF_INT_ST : RO; bitpos: [4]; default: 0;
 * This is the status bit for UART_RXFIFO_OVF_INT_RAW when
 * UART_RXFIFO_OVF_INT_ENA is set to 1.
 */

#define UART_RXFIFO_OVF_INT_ST    (BIT(4))
#define UART_RXFIFO_OVF_INT_ST_M  (UART_RXFIFO_OVF_INT_ST_V << UART_RXFIFO_OVF_INT_ST_S)
#define UART_RXFIFO_OVF_INT_ST_V  0x00000001
#define UART_RXFIFO_OVF_INT_ST_S  4

/* UART_FRM_ERR_INT_ST : RO; bitpos: [3]; default: 0;
 * This is the status bit for UART_FRM_ERR_INT_RAW when UART_FRM_ERR_INT_ENA
 * is set to 1.
 */

#define UART_FRM_ERR_INT_ST    (BIT(3))
#define UART_FRM_ERR_INT_ST_M  (UART_FRM_ERR_INT_ST_V << UART_FRM_ERR_INT_ST_S)
#define UART_FRM_ERR_INT_ST_V  0x00000001
#define UART_FRM_ERR_INT_ST_S  3

/* UART_PARITY_ERR_INT_ST : RO; bitpos: [2]; default: 0;
 * This is the status bit for UART_PARITY_ERR_INT_RAW when
 * UART_PARITY_ERR_INT_ENA is set to 1.
 */

#define UART_PARITY_ERR_INT_ST    (BIT(2))
#define UART_PARITY_ERR_INT_ST_M  (UART_PARITY_ERR_INT_ST_V << UART_PARITY_ERR_INT_ST_S)
#define UART_PARITY_ERR_INT_ST_V  0x00000001
#define UART_PARITY_ERR_INT_ST_S  2

/* UART_TXFIFO_EMPTY_INT_ST : RO; bitpos: [1]; default: 0;
 * This is the status bit for UART_TXFIFO_EMPTY_INT_RAW  when
 * UART_TXFIFO_EMPTY_INT_ENA is set to 1.
 */

#define UART_TXFIFO_EMPTY_INT_ST    (BIT(1))
#define UART_TXFIFO_EMPTY_INT_ST_M  (UART_TXFIFO_EMPTY_INT_ST_V << UART_TXFIFO_EMPTY_INT_ST_S)
#define UART_TXFIFO_EMPTY_INT_ST_V  0x00000001
#define UART_TXFIFO_EMPTY_INT_ST_S  1

/* UART_RXFIFO_FULL_INT_ST : RO; bitpos: [0]; default: 0;
 * This is the status bit for UART_RXFIFO_FULL_INT_RAW when
 * UART_RXFIFO_FULL_INT_ENA is set to 1.
 */

#define UART_RXFIFO_FULL_INT_ST    (BIT(0))
#define UART_RXFIFO_FULL_INT_ST_M  (UART_RXFIFO_FULL_INT_ST_V << UART_RXFIFO_FULL_INT_ST_S)
#define UART_RXFIFO_FULL_INT_ST_V  0x00000001
#define UART_RXFIFO_FULL_INT_ST_S  0

/* UART_INT_ENA_REG register
 * Interrupt enable bits
 */

#define UART_INT_ENA_REG(i) (REG_UART_BASE(i) + 0xc)

/* UART_WAKEUP_INT_ENA : R/W; bitpos: [19]; default: 0;
 * This is the enable bit for UART_WAKEUP_INT_ST register.
 */

#define UART_WAKEUP_INT_ENA    (BIT(19))
#define UART_WAKEUP_INT_ENA_M  (UART_WAKEUP_INT_ENA_V << UART_WAKEUP_INT_ENA_S)
#define UART_WAKEUP_INT_ENA_V  0x00000001
#define UART_WAKEUP_INT_ENA_S  19

/* UART_AT_CMD_CHAR_DET_INT_ENA : R/W; bitpos: [18]; default: 0;
 * This is the enable bit for UART_AT_CMD_CHAR_DET_INT_ST register.
 */

#define UART_AT_CMD_CHAR_DET_INT_ENA    (BIT(18))
#define UART_AT_CMD_CHAR_DET_INT_ENA_M  (UART_AT_CMD_CHAR_DET_INT_ENA_V << UART_AT_CMD_CHAR_DET_INT_ENA_S)
#define UART_AT_CMD_CHAR_DET_INT_ENA_V  0x00000001
#define UART_AT_CMD_CHAR_DET_INT_ENA_S  18

/* UART_RS485_CLASH_INT_ENA : R/W; bitpos: [17]; default: 0;
 * This is the enable bit for UART_RS485_CLASH_INT_ST register.
 */

#define UART_RS485_CLASH_INT_ENA    (BIT(17))
#define UART_RS485_CLASH_INT_ENA_M  (UART_RS485_CLASH_INT_ENA_V << UART_RS485_CLASH_INT_ENA_S)
#define UART_RS485_CLASH_INT_ENA_V  0x00000001
#define UART_RS485_CLASH_INT_ENA_S  17

/* UART_RS485_FRM_ERR_INT_ENA : R/W; bitpos: [16]; default: 0;
 * This is the enable bit for UART_RS485_PARITY_ERR_INT_ST register.
 */

#define UART_RS485_FRM_ERR_INT_ENA    (BIT(16))
#define UART_RS485_FRM_ERR_INT_ENA_M  (UART_RS485_FRM_ERR_INT_ENA_V << UART_RS485_FRM_ERR_INT_ENA_S)
#define UART_RS485_FRM_ERR_INT_ENA_V  0x00000001
#define UART_RS485_FRM_ERR_INT_ENA_S  16

/* UART_RS485_PARITY_ERR_INT_ENA : R/W; bitpos: [15]; default: 0;
 * This is the enable bit for UART_RS485_PARITY_ERR_INT_ST register.
 */

