apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_uart.h
#define UART_RS485_PARITY_ERR_INT_ENA    (BIT(15))
#define UART_RS485_PARITY_ERR_INT_ENA_M  (UART_RS485_PARITY_ERR_INT_ENA_V << UART_RS485_PARITY_ERR_INT_ENA_S)
#define UART_RS485_PARITY_ERR_INT_ENA_V  0x00000001
#define UART_RS485_PARITY_ERR_INT_ENA_S  15

/* UART_TX_DONE_INT_ENA : R/W; bitpos: [14]; default: 0;
 * This is the enable bit for UART_TX_DONE_INT_ST register.
 */

#define UART_TX_DONE_INT_ENA    (BIT(14))
#define UART_TX_DONE_INT_ENA_M  (UART_TX_DONE_INT_ENA_V << UART_TX_DONE_INT_ENA_S)
#define UART_TX_DONE_INT_ENA_V  0x00000001
#define UART_TX_DONE_INT_ENA_S  14

/* UART_TX_BRK_IDLE_DONE_INT_ENA : R/W; bitpos: [13]; default: 0;
 * This is the enable bit for UART_TX_BRK_IDLE_DONE_INT_ST register.
 */

#define UART_TX_BRK_IDLE_DONE_INT_ENA    (BIT(13))
#define UART_TX_BRK_IDLE_DONE_INT_ENA_M  (UART_TX_BRK_IDLE_DONE_INT_ENA_V << UART_TX_BRK_IDLE_DONE_INT_ENA_S)
#define UART_TX_BRK_IDLE_DONE_INT_ENA_V  0x00000001
#define UART_TX_BRK_IDLE_DONE_INT_ENA_S  13

/* UART_TX_BRK_DONE_INT_ENA : R/W; bitpos: [12]; default: 0;
 * This is the enable bit for UART_TX_BRK_DONE_INT_ST register.
 */

#define UART_TX_BRK_DONE_INT_ENA    (BIT(12))
#define UART_TX_BRK_DONE_INT_ENA_M  (UART_TX_BRK_DONE_INT_ENA_V << UART_TX_BRK_DONE_INT_ENA_S)
#define UART_TX_BRK_DONE_INT_ENA_V  0x00000001
#define UART_TX_BRK_DONE_INT_ENA_S  12

/* UART_GLITCH_DET_INT_ENA : R/W; bitpos: [11]; default: 0;
 * This is the enable bit for UART_GLITCH_DET_INT_ST register.
 */

#define UART_GLITCH_DET_INT_ENA    (BIT(11))
#define UART_GLITCH_DET_INT_ENA_M  (UART_GLITCH_DET_INT_ENA_V << UART_GLITCH_DET_INT_ENA_S)
#define UART_GLITCH_DET_INT_ENA_V  0x00000001
#define UART_GLITCH_DET_INT_ENA_S  11

/* UART_SW_XOFF_INT_ENA : R/W; bitpos: [10]; default: 0;
 * This is the enable bit for UART_SW_XOFF_INT_ST register.
 */

#define UART_SW_XOFF_INT_ENA    (BIT(10))
#define UART_SW_XOFF_INT_ENA_M  (UART_SW_XOFF_INT_ENA_V << UART_SW_XOFF_INT_ENA_S)
#define UART_SW_XOFF_INT_ENA_V  0x00000001
#define UART_SW_XOFF_INT_ENA_S  10

/* UART_SW_XON_INT_ENA : R/W; bitpos: [9]; default: 0;
 * This is the enable bit for UART_SW_XON_INT_ST register.
 */

#define UART_SW_XON_INT_ENA    (BIT(9))
#define UART_SW_XON_INT_ENA_M  (UART_SW_XON_INT_ENA_V << UART_SW_XON_INT_ENA_S)
#define UART_SW_XON_INT_ENA_V  0x00000001
#define UART_SW_XON_INT_ENA_S  9

/* UART_RXFIFO_TOUT_INT_ENA : R/W; bitpos: [8]; default: 0;
 * This is the enable bit for UART_RXFIFO_TOUT_INT_ST register.
 */

#define UART_RXFIFO_TOUT_INT_ENA    (BIT(8))
#define UART_RXFIFO_TOUT_INT_ENA_M  (UART_RXFIFO_TOUT_INT_ENA_V << UART_RXFIFO_TOUT_INT_ENA_S)
#define UART_RXFIFO_TOUT_INT_ENA_V  0x00000001
#define UART_RXFIFO_TOUT_INT_ENA_S  8

/* UART_BRK_DET_INT_ENA : R/W; bitpos: [7]; default: 0;
 * This is the enable bit for UART_BRK_DET_INT_ST register.
 */

#define UART_BRK_DET_INT_ENA    (BIT(7))
#define UART_BRK_DET_INT_ENA_M  (UART_BRK_DET_INT_ENA_V << UART_BRK_DET_INT_ENA_S)
#define UART_BRK_DET_INT_ENA_V  0x00000001
#define UART_BRK_DET_INT_ENA_S  7

/* UART_CTS_CHG_INT_ENA : R/W; bitpos: [6]; default: 0;
 * This is the enable bit for UART_CTS_CHG_INT_ST register.
 */

#define UART_CTS_CHG_INT_ENA    (BIT(6))
#define UART_CTS_CHG_INT_ENA_M  (UART_CTS_CHG_INT_ENA_V << UART_CTS_CHG_INT_ENA_S)
#define UART_CTS_CHG_INT_ENA_V  0x00000001
#define UART_CTS_CHG_INT_ENA_S  6

/* UART_DSR_CHG_INT_ENA : R/W; bitpos: [5]; default: 0;
 * This is the enable bit for UART_DSR_CHG_INT_ST register.
 */

#define UART_DSR_CHG_INT_ENA    (BIT(5))
#define UART_DSR_CHG_INT_ENA_M  (UART_DSR_CHG_INT_ENA_V << UART_DSR_CHG_INT_ENA_S)
#define UART_DSR_CHG_INT_ENA_V  0x00000001
#define UART_DSR_CHG_INT_ENA_S  5

/* UART_RXFIFO_OVF_INT_ENA : R/W; bitpos: [4]; default: 0;
 * This is the enable bit for UART_RXFIFO_OVF_INT_ST register.
 */

#define UART_RXFIFO_OVF_INT_ENA    (BIT(4))
#define UART_RXFIFO_OVF_INT_ENA_M  (UART_RXFIFO_OVF_INT_ENA_V << UART_RXFIFO_OVF_INT_ENA_S)
#define UART_RXFIFO_OVF_INT_ENA_V  0x00000001
#define UART_RXFIFO_OVF_INT_ENA_S  4

/* UART_FRM_ERR_INT_ENA : R/W; bitpos: [3]; default: 0;
 * This is the enable bit for UART_FRM_ERR_INT_ST register.
 */

#define UART_FRM_ERR_INT_ENA    (BIT(3))
#define UART_FRM_ERR_INT_ENA_M  (UART_FRM_ERR_INT_ENA_V << UART_FRM_ERR_INT_ENA_S)
#define UART_FRM_ERR_INT_ENA_V  0x00000001
#define UART_FRM_ERR_INT_ENA_S  3

/* UART_PARITY_ERR_INT_ENA : R/W; bitpos: [2]; default: 0;
 * This is the enable bit for UART_PARITY_ERR_INT_ST register.
 */

#define UART_PARITY_ERR_INT_ENA    (BIT(2))
#define UART_PARITY_ERR_INT_ENA_M  (UART_PARITY_ERR_INT_ENA_V << UART_PARITY_ERR_INT_ENA_S)
#define UART_PARITY_ERR_INT_ENA_V  0x00000001
#define UART_PARITY_ERR_INT_ENA_S  2

/* UART_TXFIFO_EMPTY_INT_ENA : R/W; bitpos: [1]; default: 0;
 * This is the enable bit for UART_TXFIFO_EMPTY_INT_ST register.
 */

#define UART_TXFIFO_EMPTY_INT_ENA    (BIT(1))
#define UART_TXFIFO_EMPTY_INT_ENA_M  (UART_TXFIFO_EMPTY_INT_ENA_V << UART_TXFIFO_EMPTY_INT_ENA_S)
#define UART_TXFIFO_EMPTY_INT_ENA_V  0x00000001
#define UART_TXFIFO_EMPTY_INT_ENA_S  1

/* UART_RXFIFO_FULL_INT_ENA : R/W; bitpos: [0]; default: 0;
 * This is the enable bit for UART_RXFIFO_FULL_INT_ST register.
 */

#define UART_RXFIFO_FULL_INT_ENA    (BIT(0))
#define UART_RXFIFO_FULL_INT_ENA_M  (UART_RXFIFO_FULL_INT_ENA_V << UART_RXFIFO_FULL_INT_ENA_S)
#define UART_RXFIFO_FULL_INT_ENA_V  0x00000001
#define UART_RXFIFO_FULL_INT_ENA_S  0

/* UART_INT_CLR_REG register
 * Interrupt clear bits
 */

#define UART_INT_CLR_REG(i) (REG_UART_BASE(i) + 0x10)

/* UART_WAKEUP_INT_CLR : WO; bitpos: [19]; default: 0;
 * Set this bit to clear UART_WAKEUP_INT_RAW interrupt.
 */

#define UART_WAKEUP_INT_CLR    (BIT(19))
#define UART_WAKEUP_INT_CLR_M  (UART_WAKEUP_INT_CLR_V << UART_WAKEUP_INT_CLR_S)
#define UART_WAKEUP_INT_CLR_V  0x00000001
#define UART_WAKEUP_INT_CLR_S  19

/* UART_AT_CMD_CHAR_DET_INT_CLR : WO; bitpos: [18]; default: 0;
 * Set this bit to clear UART_AT_CMD_CHAR_DET_INT_RAW interrupt.
 */

#define UART_AT_CMD_CHAR_DET_INT_CLR    (BIT(18))
#define UART_AT_CMD_CHAR_DET_INT_CLR_M  (UART_AT_CMD_CHAR_DET_INT_CLR_V << UART_AT_CMD_CHAR_DET_INT_CLR_S)
#define UART_AT_CMD_CHAR_DET_INT_CLR_V  0x00000001
#define UART_AT_CMD_CHAR_DET_INT_CLR_S  18

