apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_uart.h
/* UART_RS485_CLASH_INT_CLR : WO; bitpos: [17]; default: 0;
 * Set this bit to clear UART_RS485_CLASH_INT_RAW interrupt.
 */

#define UART_RS485_CLASH_INT_CLR    (BIT(17))
#define UART_RS485_CLASH_INT_CLR_M  (UART_RS485_CLASH_INT_CLR_V << UART_RS485_CLASH_INT_CLR_S)
#define UART_RS485_CLASH_INT_CLR_V  0x00000001
#define UART_RS485_CLASH_INT_CLR_S  17

/* UART_RS485_FRM_ERR_INT_CLR : WO; bitpos: [16]; default: 0;
 * Set this bit to clear UART_RS485_FRM_ERR_INT_RAW interrupt.
 */

#define UART_RS485_FRM_ERR_INT_CLR    (BIT(16))
#define UART_RS485_FRM_ERR_INT_CLR_M  (UART_RS485_FRM_ERR_INT_CLR_V << UART_RS485_FRM_ERR_INT_CLR_S)
#define UART_RS485_FRM_ERR_INT_CLR_V  0x00000001
#define UART_RS485_FRM_ERR_INT_CLR_S  16

/* UART_RS485_PARITY_ERR_INT_CLR : WO; bitpos: [15]; default: 0;
 * Set this bit to clear UART_RS485_PARITY_ERR_INT_RAW interrupt.
 */

#define UART_RS485_PARITY_ERR_INT_CLR    (BIT(15))
#define UART_RS485_PARITY_ERR_INT_CLR_M  (UART_RS485_PARITY_ERR_INT_CLR_V << UART_RS485_PARITY_ERR_INT_CLR_S)
#define UART_RS485_PARITY_ERR_INT_CLR_V  0x00000001
#define UART_RS485_PARITY_ERR_INT_CLR_S  15

/* UART_TX_DONE_INT_CLR : WO; bitpos: [14]; default: 0;
 * Set this bit to clear UART_TX_DONE_INT_RAW interrupt.
 */

#define UART_TX_DONE_INT_CLR    (BIT(14))
#define UART_TX_DONE_INT_CLR_M  (UART_TX_DONE_INT_CLR_V << UART_TX_DONE_INT_CLR_S)
#define UART_TX_DONE_INT_CLR_V  0x00000001
#define UART_TX_DONE_INT_CLR_S  14

/* UART_TX_BRK_IDLE_DONE_INT_CLR : WO; bitpos: [13]; default: 0;
 * Set this bit to clear UART_TX_BRK_IDLE_DONE_INT_RAW interrupt.
 */

#define UART_TX_BRK_IDLE_DONE_INT_CLR    (BIT(13))
#define UART_TX_BRK_IDLE_DONE_INT_CLR_M  (UART_TX_BRK_IDLE_DONE_INT_CLR_V << UART_TX_BRK_IDLE_DONE_INT_CLR_S)
#define UART_TX_BRK_IDLE_DONE_INT_CLR_V  0x00000001
#define UART_TX_BRK_IDLE_DONE_INT_CLR_S  13

/* UART_TX_BRK_DONE_INT_CLR : WO; bitpos: [12]; default: 0;
 * Set this bit to clear UART_TX_BRK_DONE_INT_RAW interrupt.
 */

#define UART_TX_BRK_DONE_INT_CLR    (BIT(12))
#define UART_TX_BRK_DONE_INT_CLR_M  (UART_TX_BRK_DONE_INT_CLR_V << UART_TX_BRK_DONE_INT_CLR_S)
#define UART_TX_BRK_DONE_INT_CLR_V  0x00000001
#define UART_TX_BRK_DONE_INT_CLR_S  12

/* UART_GLITCH_DET_INT_CLR : WO; bitpos: [11]; default: 0;
 * Set this bit to clear UART_GLITCH_DET_INT_RAW interrupt.
 */

#define UART_GLITCH_DET_INT_CLR    (BIT(11))
#define UART_GLITCH_DET_INT_CLR_M  (UART_GLITCH_DET_INT_CLR_V << UART_GLITCH_DET_INT_CLR_S)
#define UART_GLITCH_DET_INT_CLR_V  0x00000001
#define UART_GLITCH_DET_INT_CLR_S  11

/* UART_SW_XOFF_INT_CLR : WO; bitpos: [10]; default: 0;
 * Set this bit to clear UART_SW_XOFF_INT_RAW interrupt.
 */

#define UART_SW_XOFF_INT_CLR    (BIT(10))
#define UART_SW_XOFF_INT_CLR_M  (UART_SW_XOFF_INT_CLR_V << UART_SW_XOFF_INT_CLR_S)
#define UART_SW_XOFF_INT_CLR_V  0x00000001
#define UART_SW_XOFF_INT_CLR_S  10

/* UART_SW_XON_INT_CLR : WO; bitpos: [9]; default: 0;
 * Set this bit to clear UART_SW_XON_INT_RAW interrupt.
 */

#define UART_SW_XON_INT_CLR    (BIT(9))
#define UART_SW_XON_INT_CLR_M  (UART_SW_XON_INT_CLR_V << UART_SW_XON_INT_CLR_S)
#define UART_SW_XON_INT_CLR_V  0x00000001
#define UART_SW_XON_INT_CLR_S  9

/* UART_RXFIFO_TOUT_INT_CLR : WO; bitpos: [8]; default: 0;
 * Set this bit to clear UART_RXFIFO_TOUT_INT_RAW interrupt.
 */

#define UART_RXFIFO_TOUT_INT_CLR    (BIT(8))
#define UART_RXFIFO_TOUT_INT_CLR_M  (UART_RXFIFO_TOUT_INT_CLR_V << UART_RXFIFO_TOUT_INT_CLR_S)
#define UART_RXFIFO_TOUT_INT_CLR_V  0x00000001
#define UART_RXFIFO_TOUT_INT_CLR_S  8

/* UART_BRK_DET_INT_CLR : WO; bitpos: [7]; default: 0;
 * Set this bit to clear UART_BRK_DET_INT_RAW interrupt.
 */

#define UART_BRK_DET_INT_CLR    (BIT(7))
#define UART_BRK_DET_INT_CLR_M  (UART_BRK_DET_INT_CLR_V << UART_BRK_DET_INT_CLR_S)
#define UART_BRK_DET_INT_CLR_V  0x00000001
#define UART_BRK_DET_INT_CLR_S  7

/* UART_CTS_CHG_INT_CLR : WO; bitpos: [6]; default: 0;
 * Set this bit to clear UART_CTS_CHG_INT_RAW interrupt.
 */

#define UART_CTS_CHG_INT_CLR    (BIT(6))
#define UART_CTS_CHG_INT_CLR_M  (UART_CTS_CHG_INT_CLR_V << UART_CTS_CHG_INT_CLR_S)
#define UART_CTS_CHG_INT_CLR_V  0x00000001
#define UART_CTS_CHG_INT_CLR_S  6

/* UART_DSR_CHG_INT_CLR : WO; bitpos: [5]; default: 0;
 * Set this bit to clear UART_DSR_CHG_INT_RAW interrupt.
 */

#define UART_DSR_CHG_INT_CLR    (BIT(5))
#define UART_DSR_CHG_INT_CLR_M  (UART_DSR_CHG_INT_CLR_V << UART_DSR_CHG_INT_CLR_S)
#define UART_DSR_CHG_INT_CLR_V  0x00000001
#define UART_DSR_CHG_INT_CLR_S  5

/* UART_RXFIFO_OVF_INT_CLR : WO; bitpos: [4]; default: 0;
 * Set this bit to clear UART_UART_RXFIFO_OVF_INT_RAW interrupt.
 */

#define UART_RXFIFO_OVF_INT_CLR    (BIT(4))
#define UART_RXFIFO_OVF_INT_CLR_M  (UART_RXFIFO_OVF_INT_CLR_V << UART_RXFIFO_OVF_INT_CLR_S)
#define UART_RXFIFO_OVF_INT_CLR_V  0x00000001
#define UART_RXFIFO_OVF_INT_CLR_S  4

/* UART_FRM_ERR_INT_CLR : WO; bitpos: [3]; default: 0;
 * Set this bit to clear UART_FRM_ERR_INT_RAW interrupt.
 */

#define UART_FRM_ERR_INT_CLR    (BIT(3))
#define UART_FRM_ERR_INT_CLR_M  (UART_FRM_ERR_INT_CLR_V << UART_FRM_ERR_INT_CLR_S)
#define UART_FRM_ERR_INT_CLR_V  0x00000001
#define UART_FRM_ERR_INT_CLR_S  3

/* UART_PARITY_ERR_INT_CLR : WO; bitpos: [2]; default: 0;
 * Set this bit to clear UART_PARITY_ERR_INT_RAW interrupt.
 */

#define UART_PARITY_ERR_INT_CLR    (BIT(2))
#define UART_PARITY_ERR_INT_CLR_M  (UART_PARITY_ERR_INT_CLR_V << UART_PARITY_ERR_INT_CLR_S)
#define UART_PARITY_ERR_INT_CLR_V  0x00000001
#define UART_PARITY_ERR_INT_CLR_S  2

/* UART_TXFIFO_EMPTY_INT_CLR : WO; bitpos: [1]; default: 0;
 * Set this bit to clear UART_TXFIFO_EMPTY_INT_RAW interrupt.
 */

#define UART_TXFIFO_EMPTY_INT_CLR    (BIT(1))
#define UART_TXFIFO_EMPTY_INT_CLR_M  (UART_TXFIFO_EMPTY_INT_CLR_V << UART_TXFIFO_EMPTY_INT_CLR_S)
#define UART_TXFIFO_EMPTY_INT_CLR_V  0x00000001
#define UART_TXFIFO_EMPTY_INT_CLR_S  1

/* UART_RXFIFO_FULL_INT_CLR : WO; bitpos: [0]; default: 0;
 * Set this bit to clear UART_THE RXFIFO_FULL_INT_RAW interrupt.
 */

#define UART_RXFIFO_FULL_INT_CLR    (BIT(0))
#define UART_RXFIFO_FULL_INT_CLR_M  (UART_RXFIFO_FULL_INT_CLR_V << UART_RXFIFO_FULL_INT_CLR_S)
#define UART_RXFIFO_FULL_INT_CLR_V  0x00000001
#define UART_RXFIFO_FULL_INT_CLR_S  0

/* UART_CLKDIV_REG register
 * Clock divider configuration
 */

