apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_uart.h
#define UART_CLKDIV_REG(i) (REG_UART_BASE(i) + 0x14)

/* UART_CLKDIV_FRAG : R/W; bitpos: [23:20]; default: 0;
 * The decimal part of the frequency divisor.
 */

#define UART_CLKDIV_FRAG    0x0000000F
#define UART_CLKDIV_FRAG_M  (UART_CLKDIV_FRAG_V << UART_CLKDIV_FRAG_S)
#define UART_CLKDIV_FRAG_V  0x0000000F
#define UART_CLKDIV_FRAG_S  20

/* UART_CLKDIV : R/W; bitpos: [19:0]; default: 694;
 * The integral part of the frequency divisor.
 */

#define UART_CLKDIV    0x000FFFFF
#define UART_CLKDIV_M  (UART_CLKDIV_V << UART_CLKDIV_S)
#define UART_CLKDIV_V  0x000FFFFF
#define UART_CLKDIV_S  0

/* UART_AUTOBAUD_REG register
 * Autobaud configuration register
 */

#define UART_AUTOBAUD_REG(i) (REG_UART_BASE(i) + 0x18)

/* UART_GLITCH_FILT : R/W; bitpos: [15:8]; default: 16;
 * when input pulse width is lower than this value, the pulse is ignored.
 * This register is used in autobaud detect process.
 */

#define UART_GLITCH_FILT    0x000000FF
#define UART_GLITCH_FILT_M  (UART_GLITCH_FILT_V << UART_GLITCH_FILT_S)
#define UART_GLITCH_FILT_V  0x000000FF
#define UART_GLITCH_FILT_S  8

/* UART_AUTOBAUD_EN : R/W; bitpos: [0]; default: 0;
 * This is the enable bit for detecting baudrate.
 */

#define UART_AUTOBAUD_EN    (BIT(0))
#define UART_AUTOBAUD_EN_M  (UART_AUTOBAUD_EN_V << UART_AUTOBAUD_EN_S)
#define UART_AUTOBAUD_EN_V  0x00000001
#define UART_AUTOBAUD_EN_S  0

/* UART_STATUS_REG register
 * UART status register
 */

#define UART_STATUS_REG(i) (REG_UART_BASE(i) + 0x1c)

/* UART_TXD : RO; bitpos: [31]; default: 0;
 * This bit represents the  level of the internal UART TXD signal.
 */

#define UART_TXD    (BIT(31))
#define UART_TXD_M  (UART_TXD_V << UART_TXD_S)
#define UART_TXD_V  0x00000001
#define UART_TXD_S  31

/* UART_RTSN : RO; bitpos: [30]; default: 0;
 * This bit represents the level of the internal UART RTS signal.
 */

#define UART_RTSN    (BIT(30))
#define UART_RTSN_M  (UART_RTSN_V << UART_RTSN_S)
#define UART_RTSN_V  0x00000001
#define UART_RTSN_S  30

/* UART_DTRN : RO; bitpos: [29]; default: 0;
 * This bit represents the level of the internal UART DTR signal.
 */

#define UART_DTRN    (BIT(29))
#define UART_DTRN_M  (UART_DTRN_V << UART_DTRN_S)
#define UART_DTRN_V  0x00000001
#define UART_DTRN_S  29

/* UART_TXFIFO_CNT : RO; bitpos: [25:16]; default: 0;
 * Stores the byte number of data in TX FIFO.
 */

#define UART_TXFIFO_CNT    0x000003FF
#define UART_TXFIFO_CNT_M  (UART_TXFIFO_CNT_V << UART_TXFIFO_CNT_S)
#define UART_TXFIFO_CNT_V  0x000003FF
#define UART_TXFIFO_CNT_S  16

/* UART_RXD : RO; bitpos: [15]; default: 0;
 * This register represent the  level value of the internal UART RXD signal.
 */

#define UART_RXD    (BIT(15))
#define UART_RXD_M  (UART_RXD_V << UART_RXD_S)
#define UART_RXD_V  0x00000001
#define UART_RXD_S  15

/* UART_CTSN : RO; bitpos: [14]; default: 0;
 * This register represent the level value of the internal UART CTS signal.
 */

#define UART_CTSN    (BIT(14))
#define UART_CTSN_M  (UART_CTSN_V << UART_CTSN_S)
#define UART_CTSN_V  0x00000001
#define UART_CTSN_S  14

/* UART_DSRN : RO; bitpos: [13]; default: 0;
 * The register represent the level value of the internal UART DSR signal.
 */

#define UART_DSRN    (BIT(13))
#define UART_DSRN_M  (UART_DSRN_V << UART_DSRN_S)
#define UART_DSRN_V  0x00000001
#define UART_DSRN_S  13

/* UART_RXFIFO_CNT : RO; bitpos: [9:0]; default: 0;
 * Stores the byte number of valid data in RX FIFO.
 */

#define UART_RXFIFO_CNT    0x000003FF
#define UART_RXFIFO_CNT_M  (UART_RXFIFO_CNT_V << UART_RXFIFO_CNT_S)
#define UART_RXFIFO_CNT_V  0x000003FF
#define UART_RXFIFO_CNT_S  0

/* UART_CONF0_REG register
 * Configuration register 0
 */

#define UART_CONF0_REG(i) (REG_UART_BASE(i) + 0x20)

/* UART_MEM_CLK_EN : R/W; bitpos: [28]; default: 1;
 * UART memory clock gate enable signal.
 * 1: UART memory powers on, the data of which can be read and written.
 * 0: UART memory powers down.
 */

#define UART_MEM_CLK_EN    (BIT(28))
#define UART_MEM_CLK_EN_M  (UART_MEM_CLK_EN_V << UART_MEM_CLK_EN_S)
#define UART_MEM_CLK_EN_V  0x00000001
#define UART_MEM_CLK_EN_S  28

/* UART_TICK_REF_ALWAYS_ON : R/W; bitpos: [27]; default: 1;
 * This register is used to select the clock.
 * 1'h1: APB_CLK.
 * 1'h0: REF_TICK.
 */

#define UART_TICK_REF_ALWAYS_ON    (BIT(27))
#define UART_TICK_REF_ALWAYS_ON_M  (UART_TICK_REF_ALWAYS_ON_V << UART_TICK_REF_ALWAYS_ON_S)
#define UART_TICK_REF_ALWAYS_ON_V  0x00000001
#define UART_TICK_REF_ALWAYS_ON_S  27

/* UART_ERR_WR_MASK : R/W; bitpos: [26]; default: 0;
 * 1'h1: Receiver stops storing data into FIFO when data is wrong. 1'h0:
 * Receiver stores the data even if the  received data is wrong.
 */

#define UART_ERR_WR_MASK    (BIT(26))
#define UART_ERR_WR_MASK_M  (UART_ERR_WR_MASK_V << UART_ERR_WR_MASK_S)
#define UART_ERR_WR_MASK_V  0x00000001
#define UART_ERR_WR_MASK_S  26

/* UART_CLK_EN : R/W; bitpos: [25]; default: 0;
 * 1'h1: Force clock on for register. 1'h0: Support clock only when
 * application writes registers.
 */

#define UART_CLK_EN    (BIT(25))
#define UART_CLK_EN_M  (UART_CLK_EN_V << UART_CLK_EN_S)
#define UART_CLK_EN_V  0x00000001
#define UART_CLK_EN_S  25

/* UART_DTR_INV : R/W; bitpos: [24]; default: 0;
 * Set this bit to inverse the level value of UART DTR signal.
 */

#define UART_DTR_INV    (BIT(24))
#define UART_DTR_INV_M  (UART_DTR_INV_V << UART_DTR_INV_S)
#define UART_DTR_INV_V  0x00000001
#define UART_DTR_INV_S  24

/* UART_RTS_INV : R/W; bitpos: [23]; default: 0;
 * Set this bit to inverse the level value of UART RTS signal.
 */

#define UART_RTS_INV    (BIT(23))
#define UART_RTS_INV_M  (UART_RTS_INV_V << UART_RTS_INV_S)
#define UART_RTS_INV_V  0x00000001
#define UART_RTS_INV_S  23

/* UART_TXD_INV : R/W; bitpos: [22]; default: 0;
 * Set this bit to inverse the level value of UART TXD signal.
 */

#define UART_TXD_INV    (BIT(22))
#define UART_TXD_INV_M  (UART_TXD_INV_V << UART_TXD_INV_S)
#define UART_TXD_INV_V  0x00000001
#define UART_TXD_INV_S  22

/* UART_DSR_INV : R/W; bitpos: [21]; default: 0;
 * Set this bit to inverse the level value of UART DSR signal.
 */

#define UART_DSR_INV    (BIT(21))
#define UART_DSR_INV_M  (UART_DSR_INV_V << UART_DSR_INV_S)
#define UART_DSR_INV_V  0x00000001
#define UART_DSR_INV_S  21

/* UART_CTS_INV : R/W; bitpos: [20]; default: 0;
 * Set this bit to inverse the level value of UART CTS signal.
 */

#define UART_CTS_INV    (BIT(20))
#define UART_CTS_INV_M  (UART_CTS_INV_V << UART_CTS_INV_S)
#define UART_CTS_INV_V  0x00000001
#define UART_CTS_INV_S  20

/* UART_RXD_INV : R/W; bitpos: [19]; default: 0;
 * Set this bit to inverse the level value of UART RXD signal.
 */

#define UART_RXD_INV    (BIT(19))
#define UART_RXD_INV_M  (UART_RXD_INV_V << UART_RXD_INV_S)
#define UART_RXD_INV_V  0x00000001
#define UART_RXD_INV_S  19

