apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_uart.h
/* UART_TXFIFO_RST : R/W; bitpos: [18]; default: 0;
 * Set this bit to reset the UART TX FIFO.
 */

#define UART_TXFIFO_RST    (BIT(18))
#define UART_TXFIFO_RST_M  (UART_TXFIFO_RST_V << UART_TXFIFO_RST_S)
#define UART_TXFIFO_RST_V  0x00000001
#define UART_TXFIFO_RST_S  18

/* UART_RXFIFO_RST : R/W; bitpos: [17]; default: 0;
 * Set this bit to reset the UART RX FIFO.
 */

#define UART_RXFIFO_RST    (BIT(17))
#define UART_RXFIFO_RST_M  (UART_RXFIFO_RST_V << UART_RXFIFO_RST_S)
#define UART_RXFIFO_RST_V  0x00000001
#define UART_RXFIFO_RST_S  17

/* UART_IRDA_EN : R/W; bitpos: [16]; default: 0;
 * Set this bit to enable IrDA protocol.
 */

#define UART_IRDA_EN    (BIT(16))
#define UART_IRDA_EN_M  (UART_IRDA_EN_V << UART_IRDA_EN_S)
#define UART_IRDA_EN_V  0x00000001
#define UART_IRDA_EN_S  16

/* UART_TX_FLOW_EN : R/W; bitpos: [15]; default: 0;
 * Set this bit to enable flow control function for transmitter.
 */

#define UART_TX_FLOW_EN    (BIT(15))
#define UART_TX_FLOW_EN_M  (UART_TX_FLOW_EN_V << UART_TX_FLOW_EN_S)
#define UART_TX_FLOW_EN_V  0x00000001
#define UART_TX_FLOW_EN_S  15

/* UART_LOOPBACK : R/W; bitpos: [14]; default: 0;
 * Set this bit to enable UART loopback test mode.
 */

#define UART_LOOPBACK    (BIT(14))
#define UART_LOOPBACK_M  (UART_LOOPBACK_V << UART_LOOPBACK_S)
#define UART_LOOPBACK_V  0x00000001
#define UART_LOOPBACK_S  14

/* UART_IRDA_RX_INV : R/W; bitpos: [13]; default: 0;
 * Set this bit to invert the level of IrDA receiver.
 */

#define UART_IRDA_RX_INV    (BIT(13))
#define UART_IRDA_RX_INV_M  (UART_IRDA_RX_INV_V << UART_IRDA_RX_INV_S)
#define UART_IRDA_RX_INV_V  0x00000001
#define UART_IRDA_RX_INV_S  13

/* UART_IRDA_TX_INV : R/W; bitpos: [12]; default: 0;
 * Set this bit to invert the level of IrDA transmitter.
 */

#define UART_IRDA_TX_INV    (BIT(12))
#define UART_IRDA_TX_INV_M  (UART_IRDA_TX_INV_V << UART_IRDA_TX_INV_S)
#define UART_IRDA_TX_INV_V  0x00000001
#define UART_IRDA_TX_INV_S  12

/* UART_IRDA_WCTL : R/W; bitpos: [11]; default: 0;
 * 1'h1: The IrDA transmitter's 11th bit is the same as 10th bit. 1'h0: Set
 * IrDA transmitter's 11th bit to 0.
 */

#define UART_IRDA_WCTL    (BIT(11))
#define UART_IRDA_WCTL_M  (UART_IRDA_WCTL_V << UART_IRDA_WCTL_S)
#define UART_IRDA_WCTL_V  0x00000001
#define UART_IRDA_WCTL_S  11

/* UART_IRDA_TX_EN : R/W; bitpos: [10]; default: 0;
 * This is the start enable bit for IrDA transmitter.
 */

#define UART_IRDA_TX_EN    (BIT(10))
#define UART_IRDA_TX_EN_M  (UART_IRDA_TX_EN_V << UART_IRDA_TX_EN_S)
#define UART_IRDA_TX_EN_V  0x00000001
#define UART_IRDA_TX_EN_S  10

/* UART_IRDA_DPLX : R/W; bitpos: [9]; default: 0;
 * Set this bit to enable IrDA loopback mode.
 */

#define UART_IRDA_DPLX    (BIT(9))
#define UART_IRDA_DPLX_M  (UART_IRDA_DPLX_V << UART_IRDA_DPLX_S)
#define UART_IRDA_DPLX_V  0x00000001
#define UART_IRDA_DPLX_S  9

/* UART_TXD_BRK : R/W; bitpos: [8]; default: 0;
 * Set this bit to enable transmitter to send NULL when the process of
 * sending data is done.
 */

#define UART_TXD_BRK    (BIT(8))
#define UART_TXD_BRK_M  (UART_TXD_BRK_V << UART_TXD_BRK_S)
#define UART_TXD_BRK_V  0x00000001
#define UART_TXD_BRK_S  8

/* UART_SW_DTR : R/W; bitpos: [7]; default: 0;
 * This register is used to configure the software DTR signal which is used
 * in software flow control.
 */

#define UART_SW_DTR    (BIT(7))
#define UART_SW_DTR_M  (UART_SW_DTR_V << UART_SW_DTR_S)
#define UART_SW_DTR_V  0x00000001
#define UART_SW_DTR_S  7

/* UART_SW_RTS : R/W; bitpos: [6]; default: 0;
 * This register is used to configure the software RTS signal which is used
 * in software flow control.
 */

#define UART_SW_RTS    (BIT(6))
#define UART_SW_RTS_M  (UART_SW_RTS_V << UART_SW_RTS_S)
#define UART_SW_RTS_V  0x00000001
#define UART_SW_RTS_S  6

/* UART_STOP_BIT_NUM : R/W; bitpos: [5:4]; default: 1;
 * This register is used to set the length of  stop bit.
 * 1: 1 bit  2: 1.5 bits  3: 2 bits.
 */

#define UART_STOP_BIT_NUM    0x00000003
#define UART_STOP_BIT_NUM_M  (UART_STOP_BIT_NUM_V << UART_STOP_BIT_NUM_S)
#define UART_STOP_BIT_NUM_V  0x00000003
#define UART_STOP_BIT_NUM_S  4

/* UART_BIT_NUM : R/W; bitpos: [3:2]; default: 3;
 * This register is used to set the length of data.
 * 0: 5 bits  1: 6 bits  2: 7 bits  3: 8 bits.
 */

#define UART_BIT_NUM    0x00000003
#define UART_BIT_NUM_M  (UART_BIT_NUM_V << UART_BIT_NUM_S)
#define UART_BIT_NUM_V  0x00000003
#define UART_BIT_NUM_S  2

/* UART_PARITY_EN : R/W; bitpos: [1]; default: 0;
 * Set this bit to enable UART parity check.
 */

#define UART_PARITY_EN    (BIT(1))
#define UART_PARITY_EN_M  (UART_PARITY_EN_V << UART_PARITY_EN_S)
#define UART_PARITY_EN_V  0x00000001
#define UART_PARITY_EN_S  1

/* UART_PARITY : R/W; bitpos: [0]; default: 0;
 * This register is used to configure the parity check mode.
 * 1'h0: even. 1'h1: odd.
 */

#define UART_PARITY    (BIT(0))
#define UART_PARITY_M  (UART_PARITY_V << UART_PARITY_S)
#define UART_PARITY_V  0x00000001
#define UART_PARITY_S  0

/* UART_CONF1_REG register
 * Configuration register 1
 */

#define UART_CONF1_REG(i) (REG_UART_BASE(i) + 0x24)

/* UART_RX_TOUT_EN : R/W; bitpos: [31]; default: 0;
 * This is the enable bit for UART receiver's timeout function.
 */

#define UART_RX_TOUT_EN    (BIT(31))
#define UART_RX_TOUT_EN_M  (UART_RX_TOUT_EN_V << UART_RX_TOUT_EN_S)
#define UART_RX_TOUT_EN_V  0x00000001
#define UART_RX_TOUT_EN_S  31

/* UART_RX_FLOW_EN : R/W; bitpos: [30]; default: 0;
 * This is the flow enable bit for UART receiver.
 * 1'h1: Choose software flow control with configuring sw_rts signal. 1'h0:
 * Disable software flow control.
 */

#define UART_RX_FLOW_EN    (BIT(30))
#define UART_RX_FLOW_EN_M  (UART_RX_FLOW_EN_V << UART_RX_FLOW_EN_S)
#define UART_RX_FLOW_EN_V  0x00000001
#define UART_RX_FLOW_EN_S  30

/* UART_RX_TOUT_FLOW_DIS : R/W; bitpos: [29]; default: 0;
 * Set this bit to stop accumulating idle_cnt when hardware flow control
 * works.
 */

#define UART_RX_TOUT_FLOW_DIS    (BIT(29))
#define UART_RX_TOUT_FLOW_DIS_M  (UART_RX_TOUT_FLOW_DIS_V << UART_RX_TOUT_FLOW_DIS_S)
#define UART_RX_TOUT_FLOW_DIS_V  0x00000001
#define UART_RX_TOUT_FLOW_DIS_S  29

/* UART_TXFIFO_EMPTY_THRHD : R/W; bitpos: [17:9]; default: 96;
 * It will produce UART_TXFIFO_EMPTY_INT interrupt when the data amount in
 * TX FIFO is less than this register value.
 */

#define UART_TXFIFO_EMPTY_THRHD    0x000001FF
#define UART_TXFIFO_EMPTY_THRHD_M  (UART_TXFIFO_EMPTY_THRHD_V << UART_TXFIFO_EMPTY_THRHD_S)
#define UART_TXFIFO_EMPTY_THRHD_V  0x000001FF
#define UART_TXFIFO_EMPTY_THRHD_S  9

/* UART_RXFIFO_FULL_THRHD : R/W; bitpos: [8:0]; default: 96;
 * It will produce UART_RXFIFO_FULL_INT interrupt when receiver receives
 * more data than this register value.
 */

#define UART_RXFIFO_FULL_THRHD    0x000001FF
#define UART_RXFIFO_FULL_THRHD_M  (UART_RXFIFO_FULL_THRHD_V << UART_RXFIFO_FULL_THRHD_S)
#define UART_RXFIFO_FULL_THRHD_V  0x000001FF
#define UART_RXFIFO_FULL_THRHD_S  0

/* UART_LOWPULSE_REG register
 * Autobaud minimum low pulse duration register
 */

#define UART_LOWPULSE_REG(i) (REG_UART_BASE(i) + 0x28)

/* UART_LOWPULSE_MIN_CNT : RO; bitpos: [19:0]; default: 1048575;
 * This register stores the value of the minimum duration time of the low
 * level pulse. It is used in baud rate detection.
 */

#define UART_LOWPULSE_MIN_CNT    0x000FFFFF
#define UART_LOWPULSE_MIN_CNT_M  (UART_LOWPULSE_MIN_CNT_V << UART_LOWPULSE_MIN_CNT_S)
#define UART_LOWPULSE_MIN_CNT_V  0x000FFFFF
#define UART_LOWPULSE_MIN_CNT_S  0

/* UART_HIGHPULSE_REG register
 * Autobaud minimum high pulse duration register
 */

#define UART_HIGHPULSE_REG(i) (REG_UART_BASE(i) + 0x2c)

/* UART_HIGHPULSE_MIN_CNT : RO; bitpos: [19:0]; default: 1048575;
 * This register stores  the value of the maximum duration time for the high
 * level pulse. It is used in baud rate detection.
 */

