apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_uart.h
#define UART_HIGHPULSE_MIN_CNT    0x000FFFFF
#define UART_HIGHPULSE_MIN_CNT_M  (UART_HIGHPULSE_MIN_CNT_V << UART_HIGHPULSE_MIN_CNT_S)
#define UART_HIGHPULSE_MIN_CNT_V  0x000FFFFF
#define UART_HIGHPULSE_MIN_CNT_S  0

/* UART_RXD_CNT_REG register
 * Autobaud edge change count register
 */

#define UART_RXD_CNT_REG(i) (REG_UART_BASE(i) + 0x30)

/* UART_RXD_EDGE_CNT : RO; bitpos: [9:0]; default: 0;
 * This register stores the count of rxd edge change. It is used in baud
 * rate detection.
 */

#define UART_RXD_EDGE_CNT    0x000003FF
#define UART_RXD_EDGE_CNT_M  (UART_RXD_EDGE_CNT_V << UART_RXD_EDGE_CNT_S)
#define UART_RXD_EDGE_CNT_V  0x000003FF
#define UART_RXD_EDGE_CNT_S  0

/* UART_FLOW_CONF_REG register
 * Software flow control configuration
 */

#define UART_FLOW_CONF_REG(i) (REG_UART_BASE(i) + 0x34)

/* UART_SEND_XOFF : R/W; bitpos: [5]; default: 0;
 * Set this bit to send XOFF character. It is cleared by hardware
 * automatically.
 */

#define UART_SEND_XOFF    (BIT(5))
#define UART_SEND_XOFF_M  (UART_SEND_XOFF_V << UART_SEND_XOFF_S)
#define UART_SEND_XOFF_V  0x00000001
#define UART_SEND_XOFF_S  5

/* UART_SEND_XON : R/W; bitpos: [4]; default: 0;
 * Set this bit to send XON character. It is cleared by hardware
 * automatically.
 */

#define UART_SEND_XON    (BIT(4))
#define UART_SEND_XON_M  (UART_SEND_XON_V << UART_SEND_XON_S)
#define UART_SEND_XON_V  0x00000001
#define UART_SEND_XON_S  4

/* UART_FORCE_XOFF : R/W; bitpos: [3]; default: 0;
 * Set this bit to stop the  transmitter from sending data.
 */

#define UART_FORCE_XOFF    (BIT(3))
#define UART_FORCE_XOFF_M  (UART_FORCE_XOFF_V << UART_FORCE_XOFF_S)
#define UART_FORCE_XOFF_V  0x00000001
#define UART_FORCE_XOFF_S  3

/* UART_FORCE_XON : R/W; bitpos: [2]; default: 0;
 * Set this bit to enable the transmitter to go on sending data.
 */

#define UART_FORCE_XON    (BIT(2))
#define UART_FORCE_XON_M  (UART_FORCE_XON_V << UART_FORCE_XON_S)
#define UART_FORCE_XON_V  0x00000001
#define UART_FORCE_XON_S  2

/* UART_XONOFF_DEL : R/W; bitpos: [1]; default: 0;
 * Set this bit to remove flow control character from the received data.
 */

#define UART_XONOFF_DEL    (BIT(1))
#define UART_XONOFF_DEL_M  (UART_XONOFF_DEL_V << UART_XONOFF_DEL_S)
#define UART_XONOFF_DEL_V  0x00000001
#define UART_XONOFF_DEL_S  1

/* UART_SW_FLOW_CON_EN : R/W; bitpos: [0]; default: 0;
 * Set this bit to enable software flow control. It is used with register
 * SW_XON or SW_XOFF.
 */

#define UART_SW_FLOW_CON_EN    (BIT(0))
#define UART_SW_FLOW_CON_EN_M  (UART_SW_FLOW_CON_EN_V << UART_SW_FLOW_CON_EN_S)
#define UART_SW_FLOW_CON_EN_V  0x00000001
#define UART_SW_FLOW_CON_EN_S  0

/* UART_SLEEP_CONF_REG register
 * Sleeping mode configuration
 */

#define UART_SLEEP_CONF_REG(i) (REG_UART_BASE(i) + 0x38)

/* UART_ACTIVE_THRESHOLD : R/W; bitpos: [9:0]; default: 240;
 * The UART is activated from light sleeping mode when the input rxd edge
 * changes more times than this register value.
 */

#define UART_ACTIVE_THRESHOLD    0x000003FF
#define UART_ACTIVE_THRESHOLD_M  (UART_ACTIVE_THRESHOLD_V << UART_ACTIVE_THRESHOLD_S)
#define UART_ACTIVE_THRESHOLD_V  0x000003FF
#define UART_ACTIVE_THRESHOLD_S  0

/* UART_SWFC_CONF0_REG register
 * Software flow control character configuration
 */

#define UART_SWFC_CONF0_REG(i) (REG_UART_BASE(i) + 0x3c)

/* UART_XOFF_CHAR : R/W; bitpos: [16:9]; default: 19;
 * This register stores the XOFF flow control character.
 */

#define UART_XOFF_CHAR    0x000000FF
#define UART_XOFF_CHAR_M  (UART_XOFF_CHAR_V << UART_XOFF_CHAR_S)
#define UART_XOFF_CHAR_V  0x000000FF
#define UART_XOFF_CHAR_S  9

/* UART_XOFF_THRESHOLD : R/W; bitpos: [8:0]; default: 224;
 * When the data amount in RX FIFO is more than this register value with
 * UART_SW_FLOW_CON_EN set to 1, it will send a XOFF character.
 */

#define UART_XOFF_THRESHOLD    0x000001FF
#define UART_XOFF_THRESHOLD_M  (UART_XOFF_THRESHOLD_V << UART_XOFF_THRESHOLD_S)
#define UART_XOFF_THRESHOLD_V  0x000001FF
#define UART_XOFF_THRESHOLD_S  0

/* UART_SWFC_CONF1_REG register
 * Software flow-control character configuration
 */

#define UART_SWFC_CONF1_REG(i) (REG_UART_BASE(i) + 0x40)

/* UART_XON_CHAR : R/W; bitpos: [16:9]; default: 17;
 * This register stores the XON flow control character.
 */

#define UART_XON_CHAR    0x000000FF
#define UART_XON_CHAR_M  (UART_XON_CHAR_V << UART_XON_CHAR_S)
#define UART_XON_CHAR_V  0x000000FF
#define UART_XON_CHAR_S  9

/* UART_XON_THRESHOLD : R/W; bitpos: [8:0]; default: 0;
 * When the data amount in RX FIFO is less than this register value with
 * UART_SW_FLOW_CON_EN set to 1, it will send a XON character.
 */

#define UART_XON_THRESHOLD    0x000001FF
#define UART_XON_THRESHOLD_M  (UART_XON_THRESHOLD_V << UART_XON_THRESHOLD_S)
#define UART_XON_THRESHOLD_V  0x000001FF
#define UART_XON_THRESHOLD_S  0

/* UART_IDLE_CONF_REG register
 * Frame-end idle configuration
 */

#define UART_IDLE_CONF_REG(i) (REG_UART_BASE(i) + 0x44)

/* UART_TX_BRK_NUM : R/W; bitpos: [27:20]; default: 10;
 * This register is used to configure the number of 0 to be sent after the
 * process of sending data is done. It is active when UART_TXD_BRK is set to
 * 1.
 */

#define UART_TX_BRK_NUM    0x000000FF
#define UART_TX_BRK_NUM_M  (UART_TX_BRK_NUM_V << UART_TX_BRK_NUM_S)
#define UART_TX_BRK_NUM_V  0x000000FF
#define UART_TX_BRK_NUM_S  20

/* UART_TX_IDLE_NUM : R/W; bitpos: [19:10]; default: 256;
 * This register is used to configure the duration time between transfers.
 */

#define UART_TX_IDLE_NUM    0x000003FF
#define UART_TX_IDLE_NUM_M  (UART_TX_IDLE_NUM_V << UART_TX_IDLE_NUM_S)
#define UART_TX_IDLE_NUM_V  0x000003FF
#define UART_TX_IDLE_NUM_S  10

/* UART_RX_IDLE_THRHD : R/W; bitpos: [9:0]; default: 256;
 * It will produce frame end signal when receiver takes more time to receive
 * one byte data than this register value.
 */

#define UART_RX_IDLE_THRHD    0x000003FF
#define UART_RX_IDLE_THRHD_M  (UART_RX_IDLE_THRHD_V << UART_RX_IDLE_THRHD_S)
#define UART_RX_IDLE_THRHD_V  0x000003FF
#define UART_RX_IDLE_THRHD_S  0

/* UART_RS485_CONF_REG register
 * RS485 mode configuration
 */

#define UART_RS485_CONF_REG(i) (REG_UART_BASE(i) + 0x48)

/* UART_RS485_TX_DLY_NUM : R/W; bitpos: [9:6]; default: 0;
 * This register is used to delay the transmitter's internal data signal.
 */

#define UART_RS485_TX_DLY_NUM    0x0000000F
#define UART_RS485_TX_DLY_NUM_M  (UART_RS485_TX_DLY_NUM_V << UART_RS485_TX_DLY_NUM_S)
#define UART_RS485_TX_DLY_NUM_V  0x0000000F
#define UART_RS485_TX_DLY_NUM_S  6

/* UART_RS485_RX_DLY_NUM : R/W; bitpos: [5]; default: 0;
 * This register is used to delay the receiver's internal data signal.
 */

