apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_uart.h
#define UART_RS485_RX_DLY_NUM    (BIT(5))
#define UART_RS485_RX_DLY_NUM_M  (UART_RS485_RX_DLY_NUM_V << UART_RS485_RX_DLY_NUM_S)
#define UART_RS485_RX_DLY_NUM_V  0x00000001
#define UART_RS485_RX_DLY_NUM_S  5

/* UART_RS485RXBY_TX_EN : R/W; bitpos: [4]; default: 0;
 * 1'h1: enable RS485 transmitter to send data when RS485 receiver line is
 * busy.
 * 1'h0: RS485 transmitter should not send data when its receiver is busy.
 */

#define UART_RS485RXBY_TX_EN    (BIT(4))
#define UART_RS485RXBY_TX_EN_M  (UART_RS485RXBY_TX_EN_V << UART_RS485RXBY_TX_EN_S)
#define UART_RS485RXBY_TX_EN_V  0x00000001
#define UART_RS485RXBY_TX_EN_S  4

/* UART_RS485TX_RX_EN : R/W; bitpos: [3]; default: 0;
 * Set this bit to enable receiver could receive data when the transmitter
 * is transmitting data in RS485 mode.
 */

#define UART_RS485TX_RX_EN    (BIT(3))
#define UART_RS485TX_RX_EN_M  (UART_RS485TX_RX_EN_V << UART_RS485TX_RX_EN_S)
#define UART_RS485TX_RX_EN_V  0x00000001
#define UART_RS485TX_RX_EN_S  3

/* UART_DL1_EN : R/W; bitpos: [2]; default: 0;
 * Set this bit to delay the stop bit by 1 bit.
 */

#define UART_DL1_EN    (BIT(2))
#define UART_DL1_EN_M  (UART_DL1_EN_V << UART_DL1_EN_S)
#define UART_DL1_EN_V  0x00000001
#define UART_DL1_EN_S  2

/* UART_DL0_EN : R/W; bitpos: [1]; default: 0;
 * Set this bit to delay the stop bit by 1 bit.
 */

#define UART_DL0_EN    (BIT(1))
#define UART_DL0_EN_M  (UART_DL0_EN_V << UART_DL0_EN_S)
#define UART_DL0_EN_V  0x00000001
#define UART_DL0_EN_S  1

/* UART_RS485_EN : R/W; bitpos: [0]; default: 0;
 * Set this bit to choose the RS485 mode.
 */

#define UART_RS485_EN    (BIT(0))
#define UART_RS485_EN_M  (UART_RS485_EN_V << UART_RS485_EN_S)
#define UART_RS485_EN_V  0x00000001
#define UART_RS485_EN_S  0

/* UART_AT_CMD_PRECNT_REG register
 * Pre-sequence timing configuration
 */

#define UART_AT_CMD_PRECNT_REG(i) (REG_UART_BASE(i) + 0x4c)

/* UART_PRE_IDLE_NUM : R/W; bitpos: [15:0]; default: 2305;
 * This register is used to configure the idle duration time before the
 * first AT_CMD is received by receiver.
 * It will not take the next data received as AT_CMD character when the
 * duration is less than this register value.
 */

#define UART_PRE_IDLE_NUM    0x0000FFFF
#define UART_PRE_IDLE_NUM_M  (UART_PRE_IDLE_NUM_V << UART_PRE_IDLE_NUM_S)
#define UART_PRE_IDLE_NUM_V  0x0000FFFF
#define UART_PRE_IDLE_NUM_S  0

/* UART_AT_CMD_POSTCNT_REG register
 * Post-sequence timing configuration
 */

#define UART_AT_CMD_POSTCNT_REG(i) (REG_UART_BASE(i) + 0x50)

/* UART_POST_IDLE_NUM : R/W; bitpos: [15:0]; default: 2305;
 * This register is used to configure the duration time between the last
 * AT_CMD and the next data.
 * It will not take the previous data as AT_CMD character when the duration
 * is less than this register value.
 */

#define UART_POST_IDLE_NUM    0x0000FFFF
#define UART_POST_IDLE_NUM_M  (UART_POST_IDLE_NUM_V << UART_POST_IDLE_NUM_S)
#define UART_POST_IDLE_NUM_V  0x0000FFFF
#define UART_POST_IDLE_NUM_S  0

/* UART_AT_CMD_GAPTOUT_REG register
 * Timeout configuration
 */

#define UART_AT_CMD_GAPTOUT_REG(i) (REG_UART_BASE(i) + 0x54)

/* UART_RX_GAP_TOUT : R/W; bitpos: [15:0]; default: 11;
 * This register is used to configure the duration time between the AT_CMD
 * chars.
 * It will not take the data as continuous AT_CMD chars when the duration
 * time is less than this register value.
 */

#define UART_RX_GAP_TOUT    0x0000FFFF
#define UART_RX_GAP_TOUT_M  (UART_RX_GAP_TOUT_V << UART_RX_GAP_TOUT_S)
#define UART_RX_GAP_TOUT_V  0x0000FFFF
#define UART_RX_GAP_TOUT_S  0

/* UART_AT_CMD_CHAR_REG register
 * AT Escape Sequence Selection Configuration
 */

#define UART_AT_CMD_CHAR_REG(i) (REG_UART_BASE(i) + 0x58)

/* UART_CHAR_NUM : R/W; bitpos: [15:8]; default: 3;
 * This register is used to configure the number of continuous AT_CMD chars
 * received by receiver.
 */

#define UART_CHAR_NUM    0x000000FF
#define UART_CHAR_NUM_M  (UART_CHAR_NUM_V << UART_CHAR_NUM_S)
#define UART_CHAR_NUM_V  0x000000FF
#define UART_CHAR_NUM_S  8

/* UART_AT_CMD_CHAR : R/W; bitpos: [7:0]; default: 43;
 * This register is used to configure the content of AT_CMD character.
 */

#define UART_AT_CMD_CHAR    0x000000FF
#define UART_AT_CMD_CHAR_M  (UART_AT_CMD_CHAR_V << UART_AT_CMD_CHAR_S)
#define UART_AT_CMD_CHAR_V  0x000000FF
#define UART_AT_CMD_CHAR_S  0

/* UART_MEM_CONF_REG register
 * UART threshold and allocation configuration
 */

#define UART_MEM_CONF_REG(i) (REG_UART_BASE(i) + 0x5c)

/* UART_MEM_FORCE_PU : R/W; bitpos: [27]; default: 0;
 * Set this bit to force power up UART memory.
 */

#define UART_MEM_FORCE_PU    (BIT(27))
#define UART_MEM_FORCE_PU_M  (UART_MEM_FORCE_PU_V << UART_MEM_FORCE_PU_S)
#define UART_MEM_FORCE_PU_V  0x00000001
#define UART_MEM_FORCE_PU_S  27

/* UART_MEM_FORCE_PD : R/W; bitpos: [26]; default: 0;
 * Set this bit to force power down UART memory.
 */

#define UART_MEM_FORCE_PD    (BIT(26))
#define UART_MEM_FORCE_PD_M  (UART_MEM_FORCE_PD_V << UART_MEM_FORCE_PD_S)
#define UART_MEM_FORCE_PD_V  0x00000001
#define UART_MEM_FORCE_PD_S  26

/* UART_RX_TOUT_THRHD : R/W; bitpos: [25:16]; default: 10;
 * This register is used to configure the threshold time that receiver takes
 * to receive one byte.
 * The UART_RXFIFO_TOUT_INT interrupt will be triggered when the receiver
 * takes more time to receive one byte with UART RX_TOUT_EN set to 1.
 */

#define UART_RX_TOUT_THRHD    0x000003FF
#define UART_RX_TOUT_THRHD_M  (UART_RX_TOUT_THRHD_V << UART_RX_TOUT_THRHD_S)
#define UART_RX_TOUT_THRHD_V  0x000003FF
#define UART_RX_TOUT_THRHD_S  16

/* UART_RX_FLOW_THRHD : R/W; bitpos: [15:7]; default: 0;
 * This register is used to configure the maximum amount of data that can be
 * received  when hardware flow control works.
 */

#define UART_RX_FLOW_THRHD    0x000001FF
#define UART_RX_FLOW_THRHD_M  (UART_RX_FLOW_THRHD_V << UART_RX_FLOW_THRHD_S)
#define UART_RX_FLOW_THRHD_V  0x000001FF
#define UART_RX_FLOW_THRHD_S  7

/* UART_TX_SIZE : R/W; bitpos: [6:4]; default: 1;
 * This register is used to configure the amount of mem allocated for TX
 * FIFO. The default number is 128 bytes.
 */

#define UART_TX_SIZE    0x00000007
#define UART_TX_SIZE_M  (UART_TX_SIZE_V << UART_TX_SIZE_S)
#define UART_TX_SIZE_V  0x00000007
#define UART_TX_SIZE_S  4

/* UART_RX_SIZE : R/W; bitpos: [3:1]; default: 1;
 * This register is used to configure the amount of mem allocated for RX
 * FIFO. The default number is 128 bytes.
 */

#define UART_RX_SIZE    0x00000007
#define UART_RX_SIZE_M  (UART_RX_SIZE_V << UART_RX_SIZE_S)
#define UART_RX_SIZE_V  0x00000007
#define UART_RX_SIZE_S  1

/* UART_MEM_TX_STATUS_REG register
 * TX FIFO write and read offset address
 */

#define UART_MEM_TX_STATUS_REG(i) (REG_UART_BASE(i) + 0x60)

/* UART_TX_RADDR : RO; bitpos: [20:11]; default: 0;
 * This register stores the offset address in TX FIFO when TX FSM reads data
 * via Tx_FIFO_Ctrl.
 */

