apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_uart.h
#define UART_TX_RADDR    0x000003FF
#define UART_TX_RADDR_M  (UART_TX_RADDR_V << UART_TX_RADDR_S)
#define UART_TX_RADDR_V  0x000003FF
#define UART_TX_RADDR_S  11

/* UART_APB_TX_WADDR : RO; bitpos: [9:0]; default: 0;
 * This register stores the offset address in TX FIFO when software writes
 * TX FIFO via APB.
 */

#define UART_APB_TX_WADDR    0x000003FF
#define UART_APB_TX_WADDR_M  (UART_APB_TX_WADDR_V << UART_APB_TX_WADDR_S)
#define UART_APB_TX_WADDR_V  0x000003FF
#define UART_APB_TX_WADDR_S  0

/* UART_MEM_RX_STATUS_REG register
 * RX FIFO write and read offset address
 */

#define UART_MEM_RX_STATUS_REG(i) (REG_UART_BASE(i) + 0x64)

/* UART_RX_WADDR : RO; bitpos: [20:11]; default: 0;
 * This register stores the offset address in RX FIFO when Rx_FIFO_Ctrl
 * writes RX FIFO.
 */

#define UART_RX_WADDR    0x000003FF
#define UART_RX_WADDR_M  (UART_RX_WADDR_V << UART_RX_WADDR_S)
#define UART_RX_WADDR_V  0x000003FF
#define UART_RX_WADDR_S  11

/* UART_APB_RX_RADDR : RO; bitpos: [9:0]; default: 0;
 * This register stores the offset address in RX_FIFO when software reads
 * data from RX FIFO via APB.
 */

#define UART_APB_RX_RADDR    0x000003FF
#define UART_APB_RX_RADDR_M  (UART_APB_RX_RADDR_V << UART_APB_RX_RADDR_S)
#define UART_APB_RX_RADDR_V  0x000003FF
#define UART_APB_RX_RADDR_S  0

/* UART_FSM_STATUS_REG register
 * UART transmit and receive status
 */

#define UART_FSM_STATUS_REG(i) (REG_UART_BASE(i) + 0x68)

/* UART_ST_UTX_OUT : RO; bitpos: [7:4]; default: 0;
 * This is the status register of transmitter.
 */

#define UART_ST_UTX_OUT    0x0000000F
#define UART_ST_UTX_OUT_M  (UART_ST_UTX_OUT_V << UART_ST_UTX_OUT_S)
#define UART_ST_UTX_OUT_V  0x0000000F
#define UART_ST_UTX_OUT_S  4

/* UART_ST_URX_OUT : RO; bitpos: [3:0]; default: 0;
 * This is the status register of receiver.
 */

#define UART_ST_URX_OUT    0x0000000F
#define UART_ST_URX_OUT_M  (UART_ST_URX_OUT_V << UART_ST_URX_OUT_S)
#define UART_ST_URX_OUT_V  0x0000000F
#define UART_ST_URX_OUT_S  0

/* UART_POSPULSE_REG register
 * Autobaud high pulse register
 */

#define UART_POSPULSE_REG(i) (REG_UART_BASE(i) + 0x6c)

/* UART_POSEDGE_MIN_CNT : RO; bitpos: [19:0]; default: 1048575;
 * This register stores the minimal input clock count between two positive
 * edges. It is used in baud rate detection.
 */

#define UART_POSEDGE_MIN_CNT    0x000FFFFF
#define UART_POSEDGE_MIN_CNT_M  (UART_POSEDGE_MIN_CNT_V << UART_POSEDGE_MIN_CNT_S)
#define UART_POSEDGE_MIN_CNT_V  0x000FFFFF
#define UART_POSEDGE_MIN_CNT_S  0

/* UART_NEGPULSE_REG register
 * Autobaud low pulse register
 */

#define UART_NEGPULSE_REG(i) (REG_UART_BASE(i) + 0x70)

/* UART_NEGEDGE_MIN_CNT : RO; bitpos: [19:0]; default: 1048575;
 * This register stores the minimal input clock count between two negative
 * edges. It is used in baud rate detection.
 */

#define UART_NEGEDGE_MIN_CNT    0x000FFFFF
#define UART_NEGEDGE_MIN_CNT_M  (UART_NEGEDGE_MIN_CNT_V << UART_NEGEDGE_MIN_CNT_S)
#define UART_NEGEDGE_MIN_CNT_V  0x000FFFFF
#define UART_NEGEDGE_MIN_CNT_S  0

/* UART_DATE_REG register
 * UART version control register
 */

#define UART_DATE_REG(i) (REG_UART_BASE(i) + 0x74)

/* UART_DATE : R/W; bitpos: [31:0]; default: 403187712;
 * This is the version control register.
 */

#define UART_DATE    0xFFFFFFFF
#define UART_DATE_M  (UART_DATE_V << UART_DATE_S)
#define UART_DATE_V  0xFFFFFFFF
#define UART_DATE_S  0

/* UART_ID_REG register
 * UART ID register
 */

#define UART_ID_REG(i) (REG_UART_BASE(i) + 0x78)

/* UART_ID : R/W; bitpos: [31:0]; default: 1280;
 * This register is used to configure the UART_ID.
 */

#define UART_ID    0xFFFFFFFF
#define UART_ID_M  (UART_ID_V << UART_ID_S)
#define UART_ID_V  0xFFFFFFFF
#define UART_ID_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S2_HARDWARE_ESP32S2_UART_H */
